OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/multiphase/compressibleInterFoam/laminar/depthCharge3D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    volScalarFieldValue p_rgh 1e5
    volScalarFieldValue p 1e5
    volScalarFieldValue T 300
);

regions
(
    sphereToCell
    {
        origin  (0.5 0.5 0.5);
        radius  0.1;

        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue p_rgh 1e6
            volScalarFieldValue p 1e6
            volScalarFieldValue T 578
        );
    }
    boxToCell
    {
        box (-10 1 -1) (10 10 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
        );
    }
);


// ************************************************************************* //
